todo: стартовая страница должна содеражать
- сверху слева кнопку с выпадающим боковым меню навигации по приложению
- контент:
  выполнить сканирование bth устройств
  - список ранее подключенных устройств (серый цвет которые не в зоне)
  - список найденных но ранее не добавленных
  - кнопку выполнить поиск устройств
  - сплэш для индикации что выполняется поиск

todo: бизнес
- при установке нового подключения
  если прошел коннект и эт точно simm девайс, задать имя устройству
- на засейвенное устройство можно нажать и подержать палец и перенастроить подключение
  затереть, режим дебаг вкл выкл, поменять имя но чтобы было уже не в списке
  повтор полей, который при сейве подключения

todo: навигация
- для отправки команд выбрать подключенный девайс
- в меню навигации есть:
     - стартовая страница, с устройствами
     - просмотр данных в бд по устройствам
         - логи (продублировать в устройства трафик обмена)
         - для дебага нужны сырые сообщения и десериализованные
         - целевые данные по устройству
         - сеансы подключений
     - настройки приложения
         - язык
         - менеджер подлючений
         - почистить кеш
         - почистить бд, но аккуратно
         - настройка экспорта данных